price_text = """
<b>Ура! 🥳 Тепер вам потрібно вказати ціну для вашого замовлення.</b>

<b>🖊 Впишіть, будь ласка, конкретну суму грошей,</b> якщо ви вже визначилися з ціною, наприклад, '1000'.

<b>💰 Але якщо ви ще не визначилися, не переймайтеся!</b>

<b>😊 Ви завжди можете обрати пункт 'Договірна',</b> і тоді ви зможете обговорити ціну пізніше.

"""

description_text = """

<b>Деталі завдання:</b>\n
- Основні завдання та підзавдання 📌
- Вимоги до виконавця 🧑‍💻
- Бажаний термін виконання 📅
- Іншу інформацію, яку вважаєте необхідною 📄\n
Тепер ви можете детально описати всі вимоги, очікування та бажані результати. 🎯
<i>Якщо ви думаєте, що опис не потрібен, і завдання і так зрозуміле, можете залишити це поле пустим. 🤷‍♂️</i> \n
<b>Пам’ятайте:</b> чим більше інформації ви надаєте, тим легше виконавцю буде зрозуміти ваші очікування та правильно виконати завдання! 🌟

"""

adding_materials_text = """

<b>Процес додавання:</b>\n
- Оберіть потрібні файли чи документи 📁
- Завантажте їх на платформу 🔄\n
Додавання правильних та якісних матеріалів допоможе вам і вашій команді ефективно працювати над проектом! 🌟
<i>Будь ласка, дотримуйтеся гідності та коректності при додаванні матеріалів,</i>

"""

deadline_text = """
<b>Введення Дати Дедлайну!</b>
 🌟 Тепер вам потрібно вказати дату дедлайну для виконання завдання!\n
 🚀 Будь ласка, оберіть дату, щоб усі могли ефективно планувати свій час! ⏰

"""

adding_money_text = """
<b>Процес поповнення рахунку:</b>\n
- Введіть потрібну вам суму 📈\n
<i>Будь ласка, будьте уважними під час введення суми та підтвердження операцій,</i>
"""

balance_text = """
<b>Ваш теперішній баланс: {start_data[balance]}</b>

<b>Робота з балансом:</b>\n
- <b>Додати кошти</b>: Оберіть цю опцію, щоб збільшити кількість коштів на вашому рахунку в боті. Вам буде запропоновано можливість ввести потрібну суму самостійно. 📈
- <b>Вивести кошти</b>: Якщо ви хочете зняти частину або всю суму з вашого рахунку, оберіть цю опцію. Після цього дотримуйтеся інструкцій бота для безпечного та швидкого виведення коштів. 📉\n
<i>Будь ласка, будьте обережними під час проведення фінансових операцій та введення даних,</i>
"""

accepting_payment = """
<b>🔵 Підтвердження поповнення</b>\n
<i>Ви обрали суму:</i> <b>{dialog_data[money]}</b> грн\n
🔄 Натисніть на кнопку нижче, щоб підтвердити поповнення рахунку.
"""

redirect_payment_url = """
<b>🔗 Оплата</b>\n
<i>Для здійснення оплати:</i>\n
👉 Натисніть на посилання нижче.
"""

check_password_text = """
<b>🔒 Виведення коштів і доступ до карт</b>\n
<i>Введіть ваш пароль</i> для отримання доступу до банківських карт та можливості виводу коштів.
"""

input_sum_text = """
<b>🔢 Введення суми</b>\n
<b>💱 Ваш баланс: {dialog_data[balance]} грн</b>\n
<i>Будь ласка, введіть суму,</i> яку бажаєте вивести.
<i>Пам'ятайте, що комісія на виведення становить 3%</i>
"""

choose_card_text = """
<b>🔑 Вибір картки для виведення коштів</b>\n
<i>Будь ласка, оберіть картку</i> для виведення коштів. Якщо ви ще не додавали жодної картки, просимо вас ввести дані картки.
"""

accepting_withdraw_text = """
<b>📋 Інформація про виведення</b>\n
<i>Обрана вами сума:</i> <b>{dialog_data[input_sum]}</b> грн\n
<i>Картка для виведення коштів:</i> <b>{dialog_data[withdrawal_card]}</b>
"""

input_username_text = """
🔹 <b>Введіть своє ім'я користувача</b>🔹\n
Для того, щоб почати роботу з ботом, будь ласка, вкажіть ім'я користувача, яке ви бажаєте використовувати. 
Це ім'я буде використано для ідентифікації ваших дій у боті та забезпечення персоналізованого досвіду.\n
👉 <i>Наприклад</i>: <b>JohnDoe</b>\n
Коли ви введете ім'я користувача, просто надішліть його у цьому чаті.
"""

input_email_text = """
📧 <b>Введіть свій Email</b>\n
Якщо бажаєте отримувати повідомлення на Email або відновити доступ до бота у випадку втрати пароля, будь ласка, вкажіть свою електронну адресу.\n
👉 <i>Наприклад</i>: <b>example@email.com</b>\n
Це необов'язковий крок, але він допоможе підвищити безпеку вашого облікового запису.
"""

input_password_text = """
🔒 <b>Введіть свій пароль</b>\n
Будь ласка, введіть пароль, який ви будете використовувати для входу в бота. Ваш пароль має бути безпечним та унікальним, щоб захистити ваш обліковий запис.\n
👉 <i>Не діліться своїм паролем з іншими особами</i>
"""

input_repeat_text = """
🔑 <b>Повторіть свій пароль</b>\n
Щоб підтвердити, будь ласка, введіть ваш пароль ще раз. Це необхідно для забезпечення того, що пароль було введено без помилок.\n
👉 <i>Переконайтеся, що пароль введено точно так само, як і раніше</i>
"""

auth_text = """
📝 <b>Потрібно зареєструватися в боті для подальшої роботи</b>\n
<b>Перша за все слід додати номер телефону!</b>\n
Щоб продовжити, будь ласка, пройдіть простий процес реєстрації. Реєстрація дозволить вам використовувати всі можливості бота та забезпечить персоналізований досвід.\n
👇 <b>Слідуйте інструкціям нижче, щоб почати:</b>\n
1️⃣ Введіть своє ім'я користувача.
2️⃣ Вкажіть свій Email (опціонально).
3️⃣ Створіть пароль.
4️⃣ Повторіть пароль для підтвердження.
"""

paying_text_accepted = "Замовлення було присвоєне виконавцю!"


def get_deals_warning(user_profile_status: str):
    return f"🚀 <b>Увага!</b> Ви перейшли до угод на профілі <b>{user_profile_status}</b>.\n\n" \
           "🔍 Всі доступні угоди будуть відповідати цьому типу профілю.\n\n" \
           "🔄 Якщо вам запропонував угоду клієнт, то ви знайдете її у профілі виконавця. " \
           "А якщо угоду запропонував виконавець, вона буде в профілі клієнта."


start_review_text = """
<b>🌟 Залиште Ваш Відгук! 🌟</b>

Привіт! Ми бачимо, що ви нещодавно завершили взаємодію з іншим користувачем нашого сервісу. 
Ваша думка дуже важлива для нас, і ми б хотіли запросити вас залишити відгук про цей досвід.

👤 Користувач: {username}

🔗 Завдання: {task_id}

Ми знаємо, що ваш час цінний, тому це не займе більше хвилини. Ось як ви можете це зробити:

1. Оцініть взаємодію від 1 до 5 зірочок.
2. Відмітьте позитивні риси користувача (необов'язково)
3. Відмітьте негативні риси користувача (необов'язково)
4. Додайте коментар (необов'язково) - ваші поради або зауваження допоможуть покращити наш сервіс.
5. Натисніть "Зберегти відгук", щоб поділитися своєю думкою.

✨ Ваша оцінка допомагає підтримувати якість нашої спільноти та покращує досвід користування всіма нашими сервісами. Дякуємо за ваш внесок!
"""

select_user_rating_text = """
<b>⭐️ Оцініть Вашу Взаємодію ⭐️</b>

Нам важливо знати, наскільки задоволені ви були під час вашої останньої взаємодії. 
Будь ласка, оцініть свій досвід за допомогою зірочкової системи:

1️⭐️ Зірка - Не задоволений
2️⭐️ Зірки - Могло бути краще
3️⭐️ Зірки - Задовільно
4️⭐️ Зірки - Добре
5️⭐️ Зірок - Відмінно

Кожен ваш відгук допомагає нам покращувати якість сервісу та забезпечувати кращий досвід для всіх користувачів. Дякуємо за ваш час та увагу!
"""

comment_text = """
<b>💭 Маєте Що Сказати? 💭</b>

Ваші думки та враження дуже важливі! Маєте поради або зауваження? Будь ласка, залиште короткий коментар. Він допоможе нам поліпшити наш сервіс.

📝 Поділіться своїми думками - вони цінні для нас!
"""