subject_titles = ['Автокад', 'Авторське право', 'Аграрне право України', 'Адвокатура', 'Адміністративне право',
                  'Адміністративний менеджмент', 'Алгебра', 'Аналітична хімія', 'Анатомія', 'Англійська',
                  'Антична філософія', 'Астрономія', 'Атомна фізика', 'Бази даних', 'Банк і банківські операції',
                  'Банківська система', 'Банківська справа', 'Банківське право', 'Безпека життєдіяльності',
                  'Бізнес інформатика', 'Бізнес планування', 'Біографія', 'Біологія', 'Біотехнологія', 'Біохімія',
                  'Ботаніка', 'Будівлі та споруди', 'Бухгалтерія', 'Бухгалтерський облік та аудит', 'Бюджетні системи',
                  'Вища математика', 'Військове право', 'Генетика', 'Географія', 'Геодезія', 'Геометрія', 'Геополітика',
                  'Гідравліка', 'Господарське право', 'Готельна справа', 'Готельний менеджмент', 'Гроші, кредит, банки',
                  'Демографія', 'Деонтологія', 'Деталі машин', 'Дизайн', 'Дискретна математика', 'Документознавство',
                  'Екологічне право', 'Екологія', 'Економетрика', 'Економіка', 'Економіка митної справи',
                  'Економіка підприємства', 'Економіка праці', 'Економіка туризму', 'Економічна історія',
                  'Економічна теорія', 'Економічний аналіз', 'Електроніка, електротехніка', 'Етика', 'Журналістика',
                  'Зарубіжна історія', 'Зарубіжна література', 'Земельне право', 'Інвестиції', 'Інвестиційний аналіз',
                  'Інноваційний менеджмент', 'Інтелектуальна власність', 'Інформатика', 'Інформаційне право',
                  'Іспанський', 'Історія', 'Історія архітектури', 'Історія держави і права', 'Історія журналістики',
                  'Історія релігії', 'Історія розвитку політичних вчень', 'Історія середніх віків', 'Історія України',
                  'Комерційна діяльність', 'Конституційне право', 'Контролінг підприємства', 'Конфліктологія',
                  'Криміналістика', 'Кримінальне право', 'Кримінальний процес', 'Кримінологія', 'Культурологія',
                  'Латинська мова', 'Лінгвістика', 'Література', 'Логіка', 'Логістика', 'Макроекономіка',
                  'Макрофінансової аналіз', 'Маркетинг', 'Математика', 'Медицина', 'Медичне право', 'Менеджмент',
                  'Метрологія', 'Механіка', 'Мистецтво', 'Митна справа', 'Митне право', 'Міжнародна економіка',
                  'Міжнародне право', 'Міжнародні відносини', 'Мікробіологія', 'Мікроекономіка', 'Молекулярна фізика',
                  'Музика', 'Нарисна геометрія', 'Неорганічна хімія', 'Німецька', 'Нотаріат',
                  'Оптимізаційні методи та моделі', 'Органічна хімія', 'Педагогіка', 'Поверхневі явища',
                  'Податкове право', 'Політекономія', 'Політологія', 'Право\\\\Юриспруденція', 'Правознавство',
                  'природознавство', 'Програмування', 'Психологія', 'Публіцистика', 'Регіональна економіка',
                  'Реклама та PR', 'Релігія і міфологія', 'Римське право', 'Світова економіка', 'Сімейне право',
                  'Сопромат', 'Соціальна робота', 'Соціологія', 'Статистика', 'Суспільствознавство',
                  'Теоретична механіка', 'Теорія держави і права', 'Теорія ймовірності', 'Теорія машин і механізмів',
                  'Товарознавство', 'ТОЕ', 'Торгова справа', 'Торговельне право', 'Трудове право', 'Туризм',
                  'Туроперейтинг', 'Українська література', 'Українська мова', 'Управління персоналом',
                  'Управління проектами', 'Фармація', 'Фізика', 'Фізична культура', 'Філологія', 'Філософія',
                  'Філософія права', 'Фінанси', 'Фінансове право', 'Фінансовий аналіз', 'Фінансовий менеджмент',
                  'Французький', 'Хімія', 'Цивільне право', 'Цивільний процес', 'Юридична деонтологія',
                  "Інше Програмування", "Інше Математика", "Інше Іноземні мови", "Інше Природні", "Інше Технічні"]

university_tasks = ['Практична робота', 'Лабораторна робота', 'Лекційна презентація', 'Контрольна робота',
                    'Курсова робота', 'Дипломна робота', 'Реферат', 'Есе', 'Залік', 'Екзамен', 'Творчий проект',
                    'Доповідь на конференції', 'Рецензія', 'Літературний огляд', 'Науковий стаття', 'Відео-презентація',
                    'Постер', 'Семінар', 'Кейс-стаді', 'Аналітичний звіт']

ticket_categories = [
    "Технічна Підтримка",  # Technical Support
    "Управління Акаунтом та Профілем",  # Account and Profile Management
    "Розрахунки та Платежі",  # Billing and Payments
    "Запити на Додавання Функцій",  # Feature Requests
    "Питання Безпеки",  # Security Concerns
    "Поведінка Користувачів та Скарги",  # User Conduct and Complaints
    "Проблеми з Навігацією та Використанням",  # Navigation and Usability Issues
    "Зворотній Зв'язок щодо Сервісу чи Продукту",  # Service or Product Feedback
    "Партнерство та Бізнес-Запити",  # Partnership or Business Inquiries
    "Юридичні Запитання",  # Legal Queries
    "Питання Доступності",  # Accessibility Issues
    "Інше"  # Other
]
