def get_client_instructions():
    return """
🤖 Інструкція для Користувача Бота 🤖

Cтворити замовлення 📝:
    - Ця кнопка дозволяє вам створити нове замовлення.
    - Просто натисніть на неї, вкажіть деталі завдання, і ваше замовлення буде готове!

Mої замовлення 📄:
    - Тут ви можете переглядати список усіх ваших замовлень, а також статус кожного з них.

Баланс 💵:
    - Цей розділ показує ваш поточний баланс.
    - Тут ви також можете поповнити свій рахунок або зробити інші фінансові операції.

Інструкція ❗:
    - Натисніть тут, якщо вам потрібна докладна інструкція з використання бота.

Профіль виконавця 📖:
    - Ця кнопка веде до вашого профілю виконавця.
    - Тут ви можете переглядати відгуки, статистику виконаних завдань та іншу інформацію.

Профіль замовника 🥳:
    - Це ваш особистий профіль як замовника.
    - Тут ви можете перевірити статус своїх замовлень, отримані відгуки та інше.

Налаштування профілю 💂:
    - У цьому розділі ви можете змінити налаштування вашого профілю, такі як аватар, контактні дані та інше.
    """
